Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2/ESP32_HVAC_CoolBreezeNexus_V2.ino
  void reset() {
    tempMotorSum = 0;
    tempExteriorSum = 0;
    tempInteriorSum = 0;
    ctCurrentSum = 0;
    ctVoltageSum = 0;
    apparentPowerSum = 0;
    yellowVoltageSum = 0;
    greenVoltageSum = 0;
    brownVoltageSum = 0;
    blackVoltageSum = 0;
    tankFullCount = 0;
    sampleCount = 0;
  }
  
  void addSample(float tMotor, float tExterior, float tInterior,
                 float ctCurr, float ctVolt, float appPower,
                 float yVolt, float gVolt, float bVolt, float blVolt,
                 bool tankFull, String yStatus, String gStatus, 
                 String bStatus, String blStatus, int fSpeed) {
    tempMotorSum += tMotor;
    tempExteriorSum += tExterior;
    tempInteriorSum += tInterior;
    ctCurrentSum += ctCurr;
    ctVoltageSum += ctVolt;
    apparentPowerSum += appPower;
    yellowVoltageSum += yVolt;
    greenVoltageSum += gVolt;
    brownVoltageSum += bVolt;
    blackVoltageSum += blVolt;
    if(tankFull) tankFullCount++;
    sampleCount++;
    
    // Store most recent statuses
    yellowStatus = yStatus;
    greenStatus = gStatus;
    brownStatus = bStatus;
    blackStatus = blStatus;
    fanSpeed = fSpeed;
  }
} accumulator;

// ============================================
// RTC Memory for Uptime Tracking
// ============================================
RTC_DATA_ATTR unsigned long totalUptimeSeconds = 0;
RTC_DATA_ATTR unsigned long lastResetTime = 0;
RTC_DATA_ATTR bool rtcInitialized = false;

// ============================================
// Timing Variables
// ============================================
unsigned long lastSensorRead = 0;
unsigned long lastDataSend = 0;
unsigned long lastDailyReset = 0;
unsigned long bootTime = 0;

// ============================================
// Function Prototypes
// ============================================
void launchConfigPortal();
void saveConfigCallback();

// ============================================
// State Machine
// ============================================
enum SystemState {
  STATE_SENSOR_READING,
  STATE_WIFI_CONNECT,
  STATE_DATA_SEND,
  STATE_WIFI_DISCONNECT
};
SystemState currentState = STATE_SENSOR_READING;

// ============================================
// SETUP
// ============================================
void setup() {
  Serial.begin(115200);
  delay(2000);
  
  Serial.println("\n\n========================================");
  Serial.println("  ESP32 R32 - Cool Breeze Nexus");
  Serial.println("  Firmware: " + FIRMWARE_VERSION);
  Serial.println("========================================");
  Serial.println("Device ID: " + DEVICE_ID);
  
  // Initialize RTC memory tracking
  if(!rtcInitialized) {
    totalUptimeSeconds = 0;
    lastResetTime = 0;
    rtcInitialized = true;
    Serial.println("✓ RTC memory initialized");
  } else {
    Serial.print("✓ Total uptime: ");
    Serial.print(totalUptimeSeconds / 86400);
    Serial.println(" days");
  }
  
  bootTime = millis();
  lastDailyReset = bootTime;
  
  // Check for reset button press (hold BOOT button for 3 seconds on startup)
  pinMode(RESET_BUTTON_PIN, INPUT_PULLUP);
  if(digitalRead(RESET_BUTTON_PIN) == LOW) {
    Serial.println("\n⚠ Reset button detected - Hold for 3 seconds to clear all settings...");
    unsigned long pressStart = millis();
    bool stillPressed = true;
    
    while(millis() - pressStart < RESET_HOLD_TIME) {
      if(digitalRead(RESET_BUTTON_PIN) == HIGH) {
        stillPressed = false;
        Serial.println("Button released - Reset cancelled");
        break;
      }
      if((millis() - pressStart) % 1000 == 0) {
        Serial.print(".");
      }
      delay(100);
    }
    
    if(stillPressed) {
      Serial.println("\n✓ Reset button held - CLEARING ALL SETTINGS!");
      Serial.println("  - WiFi credentials");
      Serial.println("  - Supabase config");
      Serial.println("  - Machine UUID & API Key");
      delay(500);
      
      // Clear WiFi
      WiFi.disconnect(true);
      WiFi.mode(WIFI_OFF);
      
      // Clear preferences
      preferences.begin("iot-nexus", false);
      preferences.clear();
      preferences.end();
      
      Serial.println("\n✅ All settings cleared! Rebooting...");
      Serial.println("Connect to 'ESP32_HVAC_Setup' WiFi after reboot\n");
      delay(2000);
      ESP.restart();
    }
  }
  
  // Check if 6-month reset is needed
  unsigned long uptimeMillis = totalUptimeSeconds * 1000ULL;
  if(uptimeMillis >= SIX_MONTH_RESET) {
    Serial.println("⚠ 6-month uptime reached - performing full reset...");
    delay(1000);
    
    // Clear all persistent data EXCEPT WiFi credentials
    preferences.begin("iot-nexus", false);
    preferences.clear();
    preferences.end();
    
    // Reset RTC memory
    totalUptimeSeconds = 0;
    lastResetTime = 0;
    
    // Reboot
    ESP.restart();
  }
  
  // Initialize preferences (for Supabase config)
  preferences.begin("iot-nexus", false);
  
  // Configure WiFiManager
  wifiManager.setConfigPortalTimeout(180); // 3 minutes for configuration
  wifiManager.setSaveConfigCallback(saveConfigCallback);
  
  // Add custom parameters ONLY for machine-specific info
  // (Supabase URL and Anon Key are hardcoded - same for all devices!)
  WiFiManagerParameter customMachineUUID("machine_uuid", "Machine UUID (from Dashboard)", "", 40);
  WiFiManagerParameter customMachineAPIKey("api_key", "Machine API Key (from Dashboard)", "", 100);
  
  wifiManager.addParameter(&customMachineUUID);
  wifiManager.addParameter(&customMachineAPIKey);
  
  Serial.println("\n========================================");
  Serial.println("WiFi Configuration:");
  Serial.println("========================================");
  
  // Load hardcoded Supabase credentials (same for all devices)
  supabaseUrl = String(SUPABASE_URL);
  supabaseAnonKey = String(SUPABASE_ANON_KEY);
  Serial.println("✓ Using hardcoded Supabase credentials");
  
  // Try to load saved machine-specific config
  machineUUID = preferences.getString("machine_uuid", "");
  machineAPIKey = preferences.getString("api_key", "");
  
