Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2/ESP32_HVAC_CoolBreezeNexus_V2.ino
  if(machineUUID.length() > 0 && machineAPIKey.length() > 0) {
    Serial.println("✓ Machine config loaded from memory");
    Serial.println("  Supabase URL: " + supabaseUrl);
    Serial.println("  Machine UUID: " + machineUUID);
    Serial.println("  API Key: Configured ✓");
    
    // WiFi is OFF by default - we'll connect when needed
    WiFi.mode(WIFI_OFF);
    wifiEnabled = false;
    Serial.println("✓ WiFi currently disabled (will enable for data transmission)");
  } else {
    // NO CONFIG FOUND - FORCE CONFIG PORTAL NOW!
    Serial.println("⚠ No machine config found - LAUNCHING CONFIG PORTAL NOW!");
    Serial.println("========================================");
    
    // Launch config portal immediately
    launchConfigPortal();
    
    // After config is saved, load the new values
    machineUUID = preferences.getString("machine_uuid", "");
    machineAPIKey = preferences.getString("api_key", "");
    
    Serial.println("✓ Configuration complete!");
    Serial.println("  Supabase URL: " + supabaseUrl);
    Serial.println("  Machine UUID: " + machineUUID);
    Serial.println("  API Key: Configured ✓");
    
    // WiFi is now connected via config portal
    wifiEnabled = true;
  }
  
  Serial.println("========================================\n");
  
  // Initialize hardware
  initializeHardware();
  
  // Initialize watchdog timer (10 seconds)
  // Compatible with both ESP32 core 2.x and 3.x
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // ESP32 core 3.x - new API with config struct
    esp_task_wdt_config_t twdt_config = {
      .timeout_ms = 10000,  // 10 seconds
      .idle_core_mask = (1 << portNUM_PROCESSORS) - 1,
      .trigger_panic = true
    };
    esp_task_wdt_init(&twdt_config);
    esp_task_wdt_add(NULL);
  #else
    // ESP32 core 2.x - old API
    esp_task_wdt_init(10, true);
    esp_task_wdt_add(NULL);
  #endif
  
  Serial.println("✓ Setup complete. Starting sensor readings...\n");
  Serial.println("OPERATION MODE:");
  Serial.println("  - Sensor readings: Every 1 second (WiFi OFF)");
  Serial.println("  - Data transmission: Every 60 seconds (WiFi ON briefly)");
  Serial.println("  - Daily reset: Every 24 hours");
  Serial.println("  - Full reset: Every 6 months");
  
  #if DEBUG_MODE
    Serial.println("\n⚠ DEBUG MODE ENABLED ⚠");
    Serial.println("  Detailed sensor output every reading");
    Serial.println("  To disable: Set DEBUG_MODE to 0 at top of code");
  #else
    Serial.println("\n✓ Production Mode");
    Serial.println("  Brief status every 10 readings");
  #endif
  
  Serial.println("========================================\n");
  
  // Reset accumulator
  accumulator.reset();
}

// ============================================
// Initialize Hardware
// ============================================
void initializeHardware() {
  Serial.println("Initializing hardware...");
  
  // ADC configuration
  analogSetAttenuation(ADC_11db);
  analogSetWidth(12);
  esp_adc_cal_characterize(ADC_UNIT_1, ADC_ATTEN_DB_11, ADC_WIDTH_BIT_12, 1100, &adc_chars);
  
  // CT sensor
  pinMode(CT_PIN, INPUT);
  emon1.current(CT_PIN, CALIBRATION);
  Serial.println("✓ CT sensor initialized on GPIO 36");
  
  // Temperature sensors
  sensorMotor.begin();
  sensorExterior.begin();
  sensorInterior.begin();
  Serial.println("✓ Temperature sensors initialized (GPIOs 21, 22, 23)");
  
  // Float switch
  pinMode(FLOAT_PIN, INPUT_PULLUP);
  Serial.println("✓ Float switch initialized on GPIO 5");
  
  // Pickup inputs
  pinMode(GPIO_YELLOW_EXHAUST, INPUT);
  pinMode(GPIO_GREEN_FAN, INPUT);
  pinMode(GPIO_BROWN_PUMP, INPUT);
  pinMode(GPIO_BLACK_DRAIN, INPUT);
  Serial.println("✓ Pickup inputs initialized (GPIOs 34, 35, 32, 33)");
}

// ============================================
// MAIN LOOP - State Machine
// ============================================
void loop() {
  unsigned long currentMillis = millis();
  
  // Feed watchdog
  esp_task_wdt_reset();
  
  // Check for daily reset (24 hours)
  if(currentMillis - lastDailyReset >= DAILY_RESET_INTERVAL) {
    performDailyReset();
  }
  
  // Update RTC uptime counter every second
  static unsigned long lastUptimeUpdate = 0;
  if(currentMillis - lastUptimeUpdate >= 1000) {
    totalUptimeSeconds++;
    lastUptimeUpdate = currentMillis;
  }
  
  // CRITICAL: Safety net - force WiFi off if on too long
  checkWiFiTimeout();
  
  // State machine execution
  switch(currentState) {
    case STATE_SENSOR_READING:
      stateSensorReading(currentMillis);
      break;
      
    case STATE_WIFI_CONNECT:
      stateWiFiConnect(currentMillis);
      break;
      
    case STATE_DATA_SEND:
      stateDataSend(currentMillis);
      break;
      
    case STATE_WIFI_DISCONNECT:
      stateWiFiDisconnect(currentMillis);
      break;
  }
  
  delay(10); // Small delay to prevent tight looping
}

// ============================================
// STATE: Sensor Reading (WiFi OFF)
// ============================================
void stateSensorReading(unsigned long currentMillis) {
  // Read sensors every second
  if(currentMillis - lastSensorRead >= SENSOR_READ_INTERVAL) {
    // CRITICAL: Ensure WiFi is OFF before reading
    if(wifiEnabled) {
      Serial.println("⚠ WARNING: WiFi still on during sensor read - disabling...");
      disableWiFi();
    }
    
    // Read all sensors
    float tMotor = readTemperature(sensorMotor);
    float tExterior = readTemperature(sensorExterior);
    float tInterior = readTemperature(sensorInterior);
    
    float ctCurrent, ctVoltage, apparentPower;
    readCTSensor(ctCurrent, ctVoltage, apparentPower);
    
    bool tankFull = (digitalRead(FLOAT_PIN) == LOW);
    
    float yVolt, gVolt, bVolt, blVolt;
    String yStatus, gStatus, bStatus, blStatus;
    int fanSpeed;
    readPickups(yVolt, gVolt, bVolt, blVolt, yStatus, gStatus, bStatus, blStatus, fanSpeed);
    
    // Accumulate samples
    accumulator.addSample(tMotor, tExterior, tInterior, ctCurrent, ctVoltage, 
                          apparentPower, yVolt, gVolt, bVolt, blVolt, tankFull,
                          yStatus, gStatus, bStatus, blStatus, fanSpeed);
    
