Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2/ESP32_HVAC_CoolBreezeNexus_V2.ino
    lastSensorRead = currentMillis;
    
    #if DEBUG_MODE
      // DETAILED DEBUG OUTPUT - Shows all sensor readings
      Serial.println("\n┌─────────────────────────────────────────────────────");
      Serial.print("│ Sample: ");
      Serial.print(accumulator.sampleCount);
      Serial.print("/60  |  Uptime: ");
      Serial.print(millis() / 1000);
      Serial.println(" seconds");
      Serial.println("├─────────────────────────────────────────────────────");
      
      // Temperature Sensors
      Serial.println("│ TEMPERATURE SENSORS:");
      Serial.print("│   Motor:    ");
      Serial.print(tMotor, 2);
      Serial.print(" °C");
      if(tMotor == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
      Serial.print("│   Exterior: ");
      Serial.print(tExterior, 2);
      Serial.print(" °C");
      if(tExterior == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
      Serial.print("│   Interior: ");
      Serial.print(tInterior, 2);
      Serial.print(" °C");
      if(tInterior == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
      // CT Sensor
      Serial.println("│");
      Serial.println("│ CURRENT TRANSFORMER:");
      Serial.print("│   Current:  ");
      Serial.print(ctCurrent, 2);
      Serial.println(" A");
      Serial.print("│   Voltage:  ");
      Serial.print(ctVoltage, 3);
      Serial.println(" V (ADC)");
      Serial.print("│   Power:    ");
      Serial.print(apparentPower, 1);
      Serial.println(" VA");
      
      // Float Switch
      Serial.println("│");
      Serial.println("│ FLOAT SWITCH:");
      Serial.print("│   Tank: ");
      Serial.println(tankFull ? "FULL ✓" : "EMPTY");
      
      // Pickup Inputs
      Serial.println("│");
      Serial.println("│ PICKUP INPUTS:");
      
      // Yellow (Exhaust)
      Serial.print("│   GPIO 34 Yellow: ");
      Serial.print(yVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(yStatus);
      if(yStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Green (Fan + Speed)
      Serial.print("│   GPIO 35 Green:  ");
      Serial.print(gVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(gStatus);
      if(gStatus == "ON") {
        Serial.print("  (Fan Speed: ");
        Serial.print(fanSpeed);
        Serial.print("%)");
      }
      if(gStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Brown (Pump)
      Serial.print("│   GPIO 32 Brown:  ");
      Serial.print(bVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(bStatus);
      if(bStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Black (Drain)
      Serial.print("│   GPIO 33 Black:  ");
      Serial.print(blVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(blStatus);
      if(blStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      Serial.println("└─────────────────────────────────────────────────────");
      
    #else
      // BRIEF OUTPUT (Production Mode)
      // Print brief status every 10 samples
      if(accumulator.sampleCount % 10 == 0) {
        Serial.print("📊 Samples: ");
        Serial.print(accumulator.sampleCount);
        Serial.print("/60  |  Temp Motor: ");
        Serial.print(tMotor, 1);
        Serial.print("°C  |  CT: ");
        Serial.print(ctCurrent, 2);
        Serial.println("A");
      }
    #endif
  }
  
  // Check if it's time to send data (every 60 seconds)
  if(currentMillis - lastDataSend >= DATA_SEND_INTERVAL) {
    if(accumulator.sampleCount > 0) {
      Serial.println("\n⏱ 60 seconds elapsed - transitioning to WiFi connect...");
      currentState = STATE_WIFI_CONNECT;
    } else {
      Serial.println("⚠ No samples collected - skipping transmission");
      lastDataSend = currentMillis;
    }
  }
}

// ============================================
// STATE: WiFi Connect
// ============================================
void stateWiFiConnect(unsigned long currentMillis) {
  Serial.println("\n========================================");
  Serial.println("  WIFI CONNECT STATE");
  Serial.println("========================================");
  
  enableWiFi();
  
  // Try to connect with timeout
  unsigned long connectStart = millis();
  bool connected = false;
  
  // First, try autoConnect (uses saved credentials)
  Serial.println("Attempting to connect to saved WiFi network...");
  
  WiFi.mode(WIFI_STA);
  WiFi.begin(); // Use saved credentials
  
  while(millis() - connectStart < WIFI_CONNECT_TIMEOUT) {
    if(WiFi.status() == WL_CONNECTED) {
      connected = true;
      break;
    }
    Serial.print(".");
    delay(500);
    esp_task_wdt_reset(); // Feed watchdog during connection
  }
  
  Serial.println();
  
  if(connected) {
    Serial.println("✓ WiFi connected!");
    Serial.print("  IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("  RSSI: ");
    Serial.print(WiFi.RSSI());
    Serial.println(" dBm");
    
    // Sync time with NTP
    configTime(0, 0, "pool.ntp.org");
    
    currentState = STATE_DATA_SEND;
  } else {
    Serial.println("✗ WiFi connection failed (timeout)");
    Serial.println("  Discarding accumulated data to prevent overflow");
    
    // CRITICAL: Discard data during long outages
    accumulator.reset();
    lastDataSend = millis();
    
    currentState = STATE_WIFI_DISCONNECT;
  }
}

// ============================================
// STATE: Data Send
// ============================================
void stateDataSend(unsigned long currentMillis) {
  Serial.println("\n========================================");
  Serial.println("  DATA SEND STATE");
  Serial.println("========================================");
  
  // Check if Supabase is configured
  if(supabaseUrl.length() == 0 || machineUUID.length() == 0 || machineAPIKey.length() == 0) {
    Serial.println("⚠ Supabase not fully configured - launching config portal...");
    Serial.println("  Missing:");
    if(supabaseUrl.length() == 0) Serial.println("    - Supabase URL");
    if(machineUUID.length() == 0) Serial.println("    - Machine UUID");
    if(machineAPIKey.length() == 0) Serial.println("    - Machine API Key");
    launchConfigPortal();
    currentState = STATE_WIFI_DISCONNECT;
    return;
  }
  
