Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2/ESP32_HVAC_CoolBreezeNexus_V2.ino
  float avgADC = sum / (float)ADC_SAMPLES;
  float voltage = (avgADC / 4095.0) * ADC_VREF;
  
  // Apply moving average filter
  filterArray[filterIndex] = voltage;
  
  float filteredSum = 0;
  for(int i = 0; i < FILTER_SIZE; i++) {
    filteredSum += filterArray[i];
  }
  
  return filteredSum / FILTER_SIZE;
}

// ============================================
// Get Pickup Status from Voltage
// ============================================
String getStatus(float voltage) {
  if(voltage < VOLTAGE_DISCONNECTED_MAX) {
    return "DISCONNECTED";
  } else if(voltage >= VOLTAGE_ON_MIN && voltage <= VOLTAGE_ON_MAX) {
    return "ON";
  } else if(voltage >= VOLTAGE_OFF_MIN) {
    return "OFF";
  } else {
    return "UNKNOWN";
  }
}

// ============================================
// Calculate Fan Speed
// ============================================
int calculateFanSpeed(float voltage, String status) {
  if(status != "ON") {
    return 0;
  }
  
  if(voltage >= FAN_VOLTAGE_100_SPEED && voltage <= FAN_VOLTAGE_0_SPEED) {
    float speedFloat = 100.0 - ((voltage - FAN_VOLTAGE_100_SPEED) / 
                      (FAN_VOLTAGE_0_SPEED - FAN_VOLTAGE_100_SPEED)) * 100.0;
    return constrain((int)speedFloat, 0, 100);
  } else if(voltage < FAN_VOLTAGE_100_SPEED) {
    return 100;
  } else {
    return 0;
  }
}

// ============================================
// Determine Overall Machine Status
// ============================================
String determineOverallStatus(float tMotor, float ctCurrent, bool tankFull,
                               String yStatus, String gStatus, String bStatus) {
  // CRITICAL ERRORS (Red)
  if(tMotor > 70.0) return "error";  // Motor overheating
  if(tMotor < -50.0) return "error";  // Sensor disconnected
  if(gStatus == "ON" && ctCurrent < 0.5) return "error";  // Fan on but no current (motor failure)
  if(bStatus == "ON" && !tankFull) return "error";  // Pump on but no water (will burn out pump)
  
  // WARNINGS (Orange)
  if(tMotor > 60.0) return "warning";  // Motor running hot
  if(tMotor == -999.0) return "warning";  // Sensor error
  if(yStatus == "DISCONNECTED" || gStatus == "DISCONNECTED" || 
     bStatus == "DISCONNECTED") return "warning";  // Pickup disconnected
  
  // ALL GOOD (Green)
  return "good";
}

// ============================================
// Send Data to Supabase (DASHBOARD COMPATIBLE)
// ============================================
bool sendToSupabase(float tMotor, float tExterior, float tInterior,
                    float ctCurrent, float ctVoltage, float appPower,
                    float yVolt, float gVolt, float bVolt, float blVolt,
                    bool tankFull,
                    String yStatus, String gStatus, String bStatus, String blStatus,
                    int fanSpeed) {
  
  if(WiFi.status() != WL_CONNECTED) {
    Serial.println("✗ WiFi not connected");
    return false;
  }
  
  HTTPClient http;
  http.setTimeout(HTTP_POST_TIMEOUT);
  
  // Direct REST API endpoint (temporary - will move to Edge Function later)
  // (old) String endpoint = supabaseUrl + "/rest/v1/readings_raw";
  String endpoint = supabaseUrl + "/functions/v1/esp32-data-receiver";
  // Build JSON payload - DASHBOARD COMPATIBLE SCHEMA
  StaticJsonDocument<1024> doc;
  
  // ========================================
  // REQUIRED FIELDS (Dashboard schema)
  // ========================================
  doc["machine_id"] = machineUUID;
  doc["motor_temp"] = tMotor;
  doc["outside_temp"] = tExterior;
  doc["inside_temp"] = tInterior;
  doc["current"] = ctCurrent;
  doc["voltage"] = LINE_VOLTAGE;  // 230V constant
  doc["power"] = appPower;
  doc["delta_t"] = abs(tExterior - tInterior);
  doc["is_on"] = (bStatus == "ON");  // Pump running = cooler ON
  doc["fan_active"] = (gStatus == "ON");
  doc["is_connected"] = true;
  
  // Determine overall status based on sensor readings
  doc["overall_status"] = determineOverallStatus(tMotor, ctCurrent, tankFull, 
                                                  yStatus, gStatus, bStatus);
  
  // ========================================
  // EVAPORATIVE COOLER SPECIFIC FIELDS
  // ========================================
  // Cooling cycle: Dump valve drains → Pump fills → Fan blows
  // If either pump OR dump valve is active = cooling cycle is happening
  doc["is_cooling"] = (bStatus == "ON" || blStatus == "ON");  // Pump OR Dump valve
  doc["has_water"] = tankFull;
  
  // Control states (from pickups)
  doc["exhaust_active"] = (yStatus == "ON");
  doc["pump_active"] = (bStatus == "ON");
  doc["drain_active"] = (blStatus == "ON");
  doc["fan_speed"] = fanSpeed;  // 0-100%
  
  // ========================================
  // DIAGNOSTIC VOLTAGES (for debugging)
  // ========================================
  doc["exhaust_voltage"] = yVolt;
  doc["fan_voltage"] = gVolt;
  doc["pump_voltage"] = bVolt;
  doc["drain_voltage"] = blVolt;
  
  String jsonString;
  serializeJson(doc, jsonString);
  
  Serial.println("\nPOST to Supabase:");
  Serial.println("  URL: " + endpoint);
  Serial.println("  Machine ID: " + machineUUID);
  Serial.println("  Status: " + String((const char*)doc["overall_status"]));
  
  #if DEBUG_MODE
    Serial.println("  Payload: " + jsonString);
  #endif
  
  // Send HTTP POST (using anon key for demo - will use Edge Function for production)
  http.begin(endpoint);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("apikey", supabaseAnonKey);  // Still needed for Supabase routing
  http.addHeader("Authorization", "Bearer " + machineAPIKey);  // Use machine's key
  
  unsigned long postStart = millis();
  int httpCode = http.POST(jsonString);
  unsigned long postDuration = millis() - postStart;
  
  Serial.print("  HTTP Code: ");
  Serial.print(httpCode);
  Serial.print("  (took ");
  Serial.print(postDuration / 1000.0, 1);
  Serial.println(" seconds)");
  
  bool success = false;
  
  if(httpCode == 201 || httpCode == 200) {
    success = true;
    Serial.println("  ✓ Success!");
  } else {
    Serial.println("  ✗ Error:");
    Serial.println("  " + http.getString());
    
