Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2/ESP32_HVAC_CoolBreezeNexus_V2.ino
    // Helpful error messages
    if(httpCode == 401) {
      Serial.println("  → Check Machine API Key - may be invalid or expired");
    } else if(httpCode == 404) {
      Serial.println("  → Check Machine UUID - may not exist in database");
    } else if(httpCode == 422) {
      Serial.println("  → Invalid JSON format or missing required fields");
    }
  }
  
  http.end();
  
  // Safety check: Disconnect if POST took too long
  if(postDuration > HTTP_POST_TIMEOUT) {
    Serial.println("⚠ POST took longer than expected - forcing disconnect");
  }
  
  return success;
}

// ============================================
// Launch WiFiManager Config Portal
// ============================================
void launchConfigPortal() {
  Serial.println("\n========================================");
  Serial.println("  CONFIGURATION PORTAL");
  Serial.println("========================================");
  Serial.println("Starting WiFiManager config portal...");
  Serial.println("Connect to WiFi network: 'ESP32_HVAC_Setup'");
  Serial.println("Navigate to: 192.168.4.1");
  Serial.println("========================================\n");
  
  // Start config portal
  wifiManager.startConfigPortal("ESP32_HVAC_Setup");
  
  // After config is saved
  if(WiFi.status() == WL_CONNECTED) {
    Serial.println("✓ WiFi configured and connected!");
  }
}

// ============================================
// WiFiManager Save Config Callback
// ============================================
void saveConfigCallback() {
  Serial.println("\n✓ Config saved - retrieving parameters...");
  
  // Get ONLY machine-specific parameters (Supabase credentials are hardcoded)
  machineUUID = wifiManager.server->arg("machine_uuid");
  machineAPIKey = wifiManager.server->arg("api_key");
  
  // Save ONLY machine-specific config to preferences
  preferences.putString("machine_uuid", machineUUID);
  preferences.putString("api_key", machineAPIKey);
  
  Serial.println("  Machine UUID: " + machineUUID);
  Serial.print("  Machine API Key: ");
  Serial.println(machineAPIKey.length() > 0 ? "Set ✓" : "MISSING ⚠");
  Serial.println("  Config saved to flash memory");
}

// ============================================
// Perform Daily Reset (Soft Reset)
// ============================================
void performDailyReset() {
  Serial.println("\n========================================");
  Serial.println("  DAILY RESET (24 HOURS ELAPSED)");
  Serial.println("========================================");
  Serial.println("Performing soft reset to clear RAM...");
  
  delay(1000);
  ESP.restart();
}

